# -*- coding: utf-8 -*-
# -*- mode: org -*-

#+TITLE: Measuring Hardware Counters  for HPC Application Phase Detection
#+AUTHOR: Gabriel Bronzatti Moro, Lucas Mello Schnorr

#+STARTUP: overview indent
#+LANGUAGE: pt-br
#+OPTIONS: H:3 creator:nil timestamp:nil skip:nil toc:nil num:t ^:nil ~:~
#+OPTIONS: author:nil title:nil date:nil
#+TAGS: noexport(n) deprecated(d) ignore(i)  Gabriel(G) Lucas(L)
#+EXPORT_SELECT_TAGS: export
#+EXPORT_EXCLUDE_TAGS: noexport

#+LATEX_CLASS: IEEEtran
#+LATEX_CLASS_OPTIONS: [conference,letter,10pt,final]
#+LATEX_HEADER: \usepackage[utf8]{inputenc}
#+LATEX_HEADER: \usepackage[T1]{fontenc}
#+LATEX_HEADER: \usepackage{lipsum}
#+LATEX_HEADER: \usepackage{color}
#+LATEX_HEADER: \usepackage{xspace}
#+LATEX_HEADER: \newcommand{\review}[1]{\textcolor[rgb]{1,0,0}{[Lucas: #1]}}

# You need Org 8.3.5 and Emacs 24 to make this work.
# If you do, just type make (thanks Luka Stanisic for this).

**** 30ms

#+begin_src R :results output :session *R* :exports both
library(dplyr);
df <- read.csv("../../dados/exp1_NASandLikwid/ftB.csv", sep=" ", strip.white=T);
k <-    filter(df, df$Metric=='M7') %>% as.data.frame();

k$Socket <- ifelse(k$Core %% 2 == 0,1,2);

g <- k %>% group_by(Time,Metric,Socket) %>% summarize (N=n(), mean=mean(Value)*100, se=3*sd(Value)/sqrt(N)) %>% as.data.frame();

#identificando o maior valor
maxG <- max(g$mean);
g1_g <- filter(g,mean==maxG);
g1_g

#identificando o menor valor
minG <- min(g$mean);
g2_g <- filter(g,mean==minG);
g2_g

#+end_src

#+RESULTS:
:       Time Metric Socket  N     mean          se
: 1 9.832468     M7      1 16 31.00176 0.002447148
:        Time Metric Socket  N     mean          se
: 1 0.3410059     M7      1 16 6.786985 0.005029964

**** 100ms  
#+begin_src R :results output :session *R* :exports both
library(dplyr);
df <- read.csv("../../dados/exp3_NASandLikwid/ftl2.csv", sep=" ", strip.white=T);
k <-    filter(df, df$Metric=='M7') %>% as.data.frame();

k$Socket <- ifelse(k$Core %% 2 == 0,1,2);

g <- k %>% group_by(Time,Metric,Socket) %>% summarize (N=n(), mean=mean(Value)*100, se=3*sd(Value)/sqrt(N)) %>% as.data.frame();

#identificando o maior valor
maxG <- max(g$mean);
g1_g <- filter(g,mean==maxG);
g1_g

#identificando o menor valor
minG <- min(g$mean);
g2_g <- filter(g,mean==minG);
g2_g

#+end_src

#+RESULTS:
#+begin_example

Attaching package: ‘dplyr’

The following objects are masked from ‘package:stats’:

    filter, lag

The following objects are masked from ‘package:base’:

    intersect, setdiff, setequal, union
      Time Metric Socket  N     mean          se
1 9.615836     M7      1 16 30.81585 0.002073066
       Time Metric Socket  N     mean         se
1 0.3575629     M7      2 16 10.01222 0.02316528
#+end_example

*** L3
#+begin_src R :results output graphics :file "img/ftBNas_Analise_l3.pdf" :exports both :session *RFib* 

library(dplyr);

df <- read.csv("../../dados/exp2_NASandLikwid/ftB.csv", sep=" ", strip.white=T);
k <-    filter(df, df$Metric=='M7') %>% as.data.frame();
k <- 	arrange(k,as.integer(k$Core));
k$Socket <- ifelse(k$Core %% 2 == 0,1,2);
middle <- mean(k$Value);
k$Socket <- ifelse(k$Core %% 2 == 0,1,2);
g <- k %>% group_by(Time,Metric,Socket) %>% summarize (N=n(), mean=mean(Value)*100, se=3*sd(Value)/sqrt(N)) %>% as.data.frame();

library(ggplot2);
ggplot(g[g$Metric == "M7",], aes(x=Time, y=mean,color=as.factor(Socket))) +
  	geom_line(size=0.5) + geom_point(size=1) + theme_bw() + ylim(0,100) +  
     theme(legend.position=c(0.9,0.8),
               legend.background = element_rect(fill="gray90", size=.5, linetype="dotted")) + 
     scale_color_discrete(name="CPU Socket") +
      labs(x = "Runtime (seconds)", y= "Average L3 Cache Misses (%)");

#+end_src

#+RESULTS:
[[file:img/ftBNas_Analise_l3.pdf]]

#+begin_src R :results output :session *R* :exports both
library(dplyr);
df <- read.csv("../../dados/exp2_NASandLikwid/ftB.csv", sep=" ", strip.white=T);
k <-    filter(df, df$Metric=='M7') %>% as.data.frame();

k$Socket <- ifelse(k$Core %% 2 == 0,1,2);

g <- k %>% group_by(Time,Metric,Socket) %>% summarize (N=n(), mean=mean(Value)*100, se=3*sd(Value)/sqrt(N)) %>% as.data.frame();

#identificando o maior valor
maxG <- max(g$mean);
g1_g <- filter(g,mean==maxG);
g1_g

#identificando o menor valor
minG <- min(g$mean);
g2_g <- filter(g,mean==minG);
g2_g

#+end_src

#+RESULTS:
:        Time Metric Socket  N     mean        se
: 1 0.2776482     M7      1 16 37.61564 0.2987426
:       Time Metric Socket  N       mean           se
: 1 8.711887     M7      1 16 0.02094844 5.839419e-05

*** L2

#+begin_src R :results output graphics :file "img/luBNas_Analise.pdf" :exports both :session *RFib* 

library(dplyr);

df <- read.csv("../../dados/exp1_NASandLikwid/luB.csv", sep=" ", strip.white=T);
k <-    filter(df, df$Metric=='M7') %>% as.data.frame();
k <- 	arrange(k,as.integer(k$Core));
k$Socket <- ifelse(k$Core %% 2 == 0,1,2);
middle <- mean(k$Value);
k$Socket <- ifelse(k$Core %% 2 == 0,1,2);
g <- k %>% group_by(Time,Metric,Socket) %>% summarize (N=n(), mean=mean(Value)*100, se=3*sd(Value)/sqrt(N)) %>% as.data.frame();

library(ggplot2);
ggplot(g[g$Metric == "M7",], aes(x=Time, y=mean,color=as.factor(Socket))) +
  	geom_line(size=0.5) + geom_point(size=1) + theme_bw() + ylim(0,100) +  
     theme(legend.position=c(0.9,0.8),
               legend.background = element_rect(fill="gray90", size=.5, linetype="dotted")) + 
     scale_color_discrete(name="CPU Socket") +
      labs(x = "Runtime (seconds)", y= "Average L2 Cache Misses (%)");

#+end_src

#+begin_src R :results output :session *R* :exports both
library(dplyr);
df <- read.csv("../../dados/exp1_NASandLikwid/luB.csv", sep=" ", strip.white=T);
k <-    filter(df, df$Metric=='M7') %>% as.data.frame();

k$Socket <- ifelse(k$Core %% 2 == 0,1,2);

g <- k %>% group_by(Time,Metric,Socket) %>% summarize (N=n(), mean=mean(Value)*100, se=3*sd(Value)/sqrt(N)) %>% as.data.frame();

#identificando o maior valor
maxG <- max(g$mean);
g1_g <- filter(g,mean==maxG);
g1_g

#identificando o menor valor
minG <- min(g$mean);
g2_g <- filter(g,mean==minG);
g2_g

#+end_src

#+RESULTS:
:       Time Metric Socket  N     mean         se
: 1 33.42106     M7      2 16 27.99985 0.04944031
:        Time Metric Socket  N     mean         se
: 1 0.1006167     M7      1 16 10.88676 0.02663008

*** L3

#+begin_src R :results output graphics :file "img/luBNas_Analise_l3.pdf" :exports both :session *RFib* 

library(dplyr);

df <- read.csv("../../dados/exp2_NASandLikwid/luB.csv", sep=" ", strip.white=T);
k <-    filter(df, df$Metric=='M7') %>% as.data.frame();
k <- 	arrange(k,as.integer(k$Core));
k$Socket <- ifelse(k$Core %% 2 == 0,1,2);
middle <- mean(k$Value);
k$Socket <- ifelse(k$Core %% 2 == 0,1,2);
g <- k %>% group_by(Time,Metric,Socket) %>% summarize (N=n(), mean=mean(Value)*100, se=3*sd(Value)/sqrt(N)) %>% as.data.frame();

library(ggplot2);
ggplot(g[g$Metric == "M7",], aes(x=Time, y=mean,color=as.factor(Socket))) +
  	geom_line(size=0.5) + geom_point(size=1) + theme_bw() + ylim(0,100) +  
     theme(legend.position=c(0.9,0.8),
               legend.background = element_rect(fill="gray90", size=.5, linetype="dotted")) + 
     scale_color_discrete(name="CPU Socket") +
      labs(x = "Runtime (seconds)", y= "Average L3 Cache Misses (%)");

#+end_src

#+RESULTS:
[[file:img/luBNas_Analise_l3.pdf]]


#+begin_src R :results output :session *R* :exports both
library(dplyr);
df <- read.csv("../../dados/exp2_NASandLikwid/luB.csv", sep=" ", strip.white=T);
k <-    filter(df, df$Metric=='M7') %>% as.data.frame();

k$Socket <- ifelse(k$Core %% 2 == 0,1,2);

g <- k %>% group_by(Time,Metric,Socket) %>% summarize (N=n(), mean=mean(Value)*100, se=3*sd(Value)/sqrt(N)) %>% as.data.frame();

#identificando o maior valor
maxG <- max(g$mean);
g1_g <- filter(g,mean==maxG);
g1_g

#identificando o menor valor
minG <- min(g$mean);
g2_g <- filter(g,mean==minG);
g2_g

#+end_src

#+RESULTS:
:        Time Metric Socket  N     mean        se
: 1 0.1005844     M7      1 16 13.77685 0.1511483
:       Time Metric Socket  N       mean           se
: 1 36.26222     M7      2 16 0.07087374 0.0005140726

*** L2

#+begin_src R :results output graphics :file "img/cgBNas_Analise.pdf" :exports both :session *RF* 

library(dplyr);

df <- read.csv("../../dados/exp1_NASandLikwid/cgB.csv", sep=" ", strip.white=T);
k <-    filter(df, df$Metric=='M7') %>% as.data.frame();
k <- 	arrange(k,as.integer(k$Core));
k$Socket <- ifelse(k$Core %% 2 == 0,1,2);
middle <- mean(k$Value);
k$Socket <- ifelse(k$Core %% 2 == 0,1,2);
g <- k %>% group_by(Time,Metric,Socket) %>% summarize (N=n(), mean=mean(Value)*100, se=3*sd(Value)/sqrt(N)) %>% as.data.frame();
library(ggplot2);
ggplot(g[g$Metric == "M7",], aes(x=Time, y=mean,color=as.factor(Socket))) +
  	geom_line(size=0.5) + geom_point(size=1) + theme_bw() + ylim(0,100) +  
     theme(legend.position=c(0.9,0.8),
               legend.background = element_rect(fill="gray90", size=.5, linetype="dotted")) + 
     scale_color_discrete(name="CPU Socket") +
      labs(x = "Runtime (seconds)", y= "Average L2 Cache Misses (%)");

#+end_src

#+RESULTS:
[[file:img/cgBNas_Analise.pdf]]

#+begin_src R :results output :session *R* :exports both
library(dplyr);
df <- read.csv("../../dados/exp1_NASandLikwid/cgB.csv", sep=" ", strip.white=T);
k <-    filter(df, df$Metric=='M7') %>% as.data.frame();

k$Socket <- ifelse(k$Core %% 2 == 0,1,2);

g <- k %>% group_by(Time,Metric,Socket) %>% summarize (N=n(), mean=mean(Value)*100, se=3*sd(Value)/sqrt(N)) %>% as.data.frame();

#identificando o maior valor
maxG <- max(g$mean);
g1_g <- filter(g,mean==maxG);
g1_g

#identificando o menor valor
minG <- min(g$mean);
g2_g <- filter(g,mean==minG);
g2_g

#+end_src

#+RESULTS:
:       Time Metric Socket  N    mean         se
: 1 23.69983     M7      2 16 38.6508 0.02485503
:         Time Metric Socket  N     mean        se
: 1 0.05055852     M7      1 16 10.21882 0.0773729


*** L3
#+begin_src R :results output graphics :file "img/cgBNas_Analise_l3.pdf" :exports both :session *RF* 

library(dplyr);

df <- read.csv("../../dados/exp2_NASandLikwid/cgB.csv", sep=" ", strip.white=T);
k <-    filter(df, df$Metric=='M7') %>% as.data.frame();
k <- 	arrange(k,as.integer(k$Core));
k$Socket <- ifelse(k$Core %% 2 == 0,1,2);
middle <- mean(k$Value);
k$Socket <- ifelse(k$Core %% 2 == 0,1,2);
g <- k %>% group_by(Time,Metric,Socket) %>% summarize (N=n(), mean=mean(Value)*100, se=3*sd(Value)/sqrt(N)) %>% as.data.frame();
library(ggplot2);
ggplot(g[g$Metric == "M7",], aes(x=Time, y=mean,color=as.factor(Socket))) +
  	geom_line(size=0.5) + geom_point(size=1) + theme_bw() + ylim(0,100) +  
     theme(legend.position=c(0.9,0.8),
               legend.background = element_rect(fill="gray90", size=.5, linetype="dotted")) + 
     scale_color_discrete(name="CPU Socket") +
      labs(x = "Runtime (seconds)", y= "Average L3 Cache Misses (%)");

#+end_src


#+RESULTS:
[[file:img/cgBNas_Analise_l3.pdf]]

#+begin_src R :results output :session *R* :exports both
library(dplyr);
df <- read.csv("../../dados/exp2_NASandLikwid/cgB.csv", sep=" ", strip.white=T);
k <-    filter(df, df$Metric=='M7') %>% as.data.frame();

k$Socket <- ifelse(k$Core %% 2 == 0,1,2);

g <- k %>% group_by(Time,Metric,Socket) %>% summarize (N=n(), mean=mean(Value)*100, se=3*sd(Value)/sqrt(N)) %>% as.data.frame();

#identificando o maior valor
maxG <- max(g$mean);
g1_g <- filter(g,mean==maxG);
g1_g

#identificando o menor valor
minG <- min(g$mean);
g2_g <- filter(g,mean==minG);
g2_g

#+end_src

#+RESULTS:
:         Time Metric Socket  N     mean        se
: 1 0.05055831     M7      2 16 23.65833 0.2532902
:       Time Metric Socket  N        mean           se
: 1 21.36921     M7      2 16 0.004947738 1.722305e-05

* [18:00:44; 20.08.2016] Graph500 (new plots)                      :noexport:

- Script que o professor Lucas fez para mostrar o graph500:

#+begin_src R :results output :session :exports both
library(dplyr);
df2 <- read.csv("../../dados/exp1_graph500/graph500_L2.csv", sep=" ", strip.white=T);
df2 <- df2[df2$Metric == "M7", ];
df2$Metric <- "L2";
df3 <- read.csv("../../dados/exp1_graph500/graph500_L3.csv", sep=" ", strip.white=T);
df3 <- df3[df3$Metric == "M7", ];
df3$Metric <- "L3";
df <- rbind (df2, df3);
df$Application <- "Graph500";
g <- df %>% group_by(Time,Metric,Application) %>% summarize (N=n(), mean=mean(Value)*100) %>% as.data.frame();
head(g);
#+end_src

#+RESULTS:
:         Time Metric Application  N       mean
: 1 0.05056907     L3    Graph500 32  4.7365908
: 2 0.05057705     L2    Graph500 32  8.8282538
: 3 0.11702327     L2    Graph500 32 11.3548215
: 4 0.11772690     L3    Graph500 32  0.2876260
: 5 0.18278533     L2    Graph500 32 13.6554586
: 6 0.18569630     L3    Graph500 32  0.1767422

#+begin_src R :results output graphics :file img/exp1_graph500.pdf :exports both :session
library(ggplot2);
x = 120
ggplot(g[g$Time < x & g$Time > x-25,], aes(x=Time, y=mean,color=as.factor(Metric))) +
  	geom_line(size=0.5) + geom_point(size=1) + theme_bw() + ylim(0,50) +  
     theme(legend.position=c(0.9,0.5),
               legend.background = element_rect(fill="gray90", size=.5, linetype="dotted")) + 
     scale_color_discrete(name="Cache Level") + facet_grid(Metric~Application) +
      labs(x = "Runtime (seconds)", y= "Average Cache Misses (%)");
#+end_src

#+RESULTS:
[[file:img/exp1_graph500.pdf]]



#+begin_src R :results output :session *R* :exports both
library(dplyr);
df <- read.csv("../../dados/exp1_graph500/graph500_L2.csv", sep=" ", strip.white=T);
k <-    filter(df, df$Metric=='M7') %>% as.data.frame();

k$Socket <- ifelse(k$Core %% 2 == 0,1,2);

g <- k %>% group_by(Time,Metric,Socket) %>% summarize (N=n(), mean=mean(Value)*100, se=3*sd(Value)/sqrt(N)) %>% as.data.frame();

#identificando o maior valor
maxG <- max(g$mean);
g1_g <- filter(g,mean==maxG);
g1_g

#identificando o menor valor
minG <- min(g$mean);
g2_g <- filter(g,mean==minG);
g2_g

#+end_src

#+RESULTS:
:       Time Metric Socket  N     mean         se
: 1 104.5085     M7      1 16 40.60292 0.06767261
:       Time Metric Socket  N       mean           se
: 1 28.64286     M7      2 16 0.02027027 0.0006081081


#+begin_src R :results output :session *R* :exports both
library(dplyr);
df <- read.csv("../../dados/exp1_graph500/graph500_L3.csv", sep=" ", strip.white=T);
k <-    filter(df, df$Metric=='M7') %>% as.data.frame();

k$Socket <- ifelse(k$Core %% 2 == 0,1,2);

g <- k %>% group_by(Time,Metric,Socket) %>% summarize (N=n(), mean=mean(Value)*100, se=3*sd(Value)/sqrt(N)) %>% as.data.frame();

#identificando o maior valor
maxG <- max(g$mean);
g1_g <- filter(g,mean==maxG);
g1_g

#identificando o menor valor
minG <- min(g$mean);
g2_g <- filter(g,mean==minG);
g2_g

#+end_src

#+RESULTS:
:       Time Metric Socket  N     mean        se
: 1 53.78313     M7      1 16 64.11706 0.1781744
:       Time Metric Socket  N mean se
: 1  8.61918     M7      1 16    0  0
: 2 10.66638     M7      1 16    0  0
: 3 10.87421     M7      1 16    0  0
: 4 19.06684     M7      1 16    0  0
: 5 19.27063     M7      1 16    0  0
